Repository: yagizuygarunlu/MyDoctorApp
Catalog: WebApi/Resources/SharedResource.*.resx
Languages: tr_tr

# Common.Success
source: Operation completed successfully.
tr_tr: İşlem başarıyla tamamlandı.

# Common.Error
source: An error occurred.
tr_tr: Bir hata oluştu.

# Appointments.NotFound
source: Appointment not found.
tr_tr: Randevu bulunamadı.

# Appointments.Created
source: Appointment created successfully.
tr_tr: Randevu başarıyla oluşturuldu.

# Appointments.Updated
source: Appointment updated successfully.
tr_tr: Randevu başarıyla güncellendi.

# Appointments.Deleted
source: Appointment deleted successfully.
tr_tr: Randevu başarıyla silindi.

# Appointments.InvalidDate
source: Invalid appointment date.
tr_tr: Geçersiz randevu tarihi.

# Appointments.InvalidTime
source: Invalid appointment time.
tr_tr: Geçersiz randevu saati.

# Appointments.InvalidStatus
source: Invalid appointment status.
tr_tr: Geçersiz randevu durumu.

# Appointments.Approved
source: Appointment approved successfully.
tr_tr: Randevu başarıyla onaylandı.

# Appointments.Rejected
source: Appointment rejected.
tr_tr: Randevu reddedildi.

# Appointments.Cancelled
source: Appointment cancelled successfully.
tr_tr: Randevu başarıyla iptal edildi.

# Appointments.DoctorRequired
source: Doctor is required.
tr_tr: Doktor gereklidir.

# Appointments.DoctorIdMustBeGreaterThanZero
source: Doctor ID must be greater than zero.
tr_tr: Doktor ID sıfırdan büyük olmalıdır.

# Appointments.DateRequired
source: Appointment date is required.
tr_tr: Randevu tarihi gereklidir.

# Appointments.DateMustBeInFuture
source: Appointment date must be in the future.
tr_tr: Randevu tarihi gelecekte olmalıdır.

# Auth.InvalidCredentials
source: Invalid credentials.
tr_tr: Geçersiz kimlik bilgileri.

# Auth.UserNotFound
source: User not found.
tr_tr: Kullanıcı bulunamadı.

# Auth.PasswordIncorrect
source: Password is incorrect.
tr_tr: Şifre yanlış.

# Auth.TokenExpired
source: Token has expired.
tr_tr: Token süresi doldu.

# Auth.TokenInvalid
source: Token is invalid.
tr_tr: Geçersiz token.

# Auth.TokenMissing
source: Token is missing.
tr_tr: Token eksik.

# Auth.UserAlreadyExists
source: User already exists.
tr_tr: Kullanıcı zaten mevcut.

# Auth.UserCreated
source: User created successfully.
tr_tr: Kullanıcı başarıyla oluşturuldu.

# Auth.UserUpdated
source: User updated successfully.
tr_tr: Kullanıcı başarıyla güncellendi.

# Auth.UserDeleted
source: User deleted successfully.
tr_tr: Kullanıcı başarıyla silindi.

# Patients.NotFound
source: Patient not found.
tr_tr: Hasta bulunamadı.

# Patients.Created
source: Patient created successfully.
tr_tr: Hasta başarıyla oluşturuldu.

# Patients.Updated
source: Patient updated successfully.
tr_tr: Hasta başarıyla güncellendi.

# Patients.Deleted
source: Patient deleted successfully.
tr_tr: Hasta başarıyla silindi.

# Patients.NameRequired
source: Patient name is required.
tr_tr: Hasta adı gereklidir.

# Patients.EmailRequired
source: Patient email is required.
tr_tr: Hasta e-postası gereklidir.

# Patients.InvalidEmail
source: Invalid email format.
tr_tr: Geçersiz e-posta formatı.

# Patients.PhoneRequired
source: Patient phone number is required.
tr_tr: Hasta telefon numarası gereklidir.

# Patients.InvalidPhone
source: Invalid phone number format.
tr_tr: Geçersiz telefon numarası formatı.

# Patients.CreatingFailed
source: Failed to create patient.
tr_tr: Hasta oluşturma başarısız oldu.

# Treatments.NotFound
source: Treatment not found.
tr_tr: Tedavi bulunamadı.

# Treatments.Created
source: Treatment created successfully.
tr_tr: Tedavi başarıyla oluşturuldu.

# Treatments.Updated
source: Treatment updated successfully.
tr_tr: Tedavi başarıyla güncellendi.

# Treatments.Deleted
source: Treatment deleted successfully.
tr_tr: Tedavi başarıyla silindi.

# Treatments.Reactivated
source: Treatment reactivated successfully.
tr_tr: Tedavi başarıyla yeniden aktifleştirildi.

# Treatments.NameRequired
source: Treatment name is required.
tr_tr: Tedavi adı gereklidir.

# Treatments.QuestionRequired
source: Question is required.
tr_tr: Soru gereklidir.

# Treatments.AnswerRequired
source: Answer is required.
tr_tr: Cevap gereklidir.

# Treatments.TreatmentIdRequired
source: Treatment ID is required.
tr_tr: Tedavi ID gereklidir.

# Treatments.InvalidTreatmentId
source: Treatment ID must be greater than 0.
tr_tr: Tedavi ID sıfırdan büyük olmalıdır.

# Treatments.CreationFailed
source: Failed to create treatment.
tr_tr: Tedavi oluşturma başarısız oldu.

# CarouselItems.NotFound
source: Carousel item not found.
tr_tr: Carousel öğesi bulunamadı.

# CarouselItems.Created
source: Carousel item created successfully.
tr_tr: Carousel öğesi başarıyla oluşturuldu.

# CarouselItems.Updated
source: Carousel item updated successfully.
tr_tr: Carousel öğesi başarıyla güncellendi.

# CarouselItems.Deleted
source: Carousel item deleted successfully.
tr_tr: Carousel öğesi başarıyla silindi.

# CarouselItems.TitleRequired
source: Carousel item title is required.
tr_tr: Carousel öğesi başlığı gereklidir.

# CarouselItems.ImageUrlRequired
source: Carousel item image URL is required.
tr_tr: Carousel öğesi resim URL'si gereklidir.

# CarouselItems.InvalidDisplayOrder
source: Display order must be greater than 0.
tr_tr: Görüntüleme sırası sıfırdan büyük olmalıdır.

# CarouselItems.Reactivated
source: Carousel item reactivated successfully.
tr_tr: Carousel öğesi başarıyla yeniden aktifleştirildi.

# Doctors.FullNameRequired
source: Doctor's full name is required.
tr_tr: Doktorun tam adı gereklidir.

# Doctors.FullNameMaxLength
source: Doctor's full name must not exceed 100 characters.
tr_tr: Doktorun tam adı 100 karakteri geçmemelidir.

# Doctors.SpecialityRequired
source: Speciality is required.
tr_tr: Uzmanlık alanı gereklidir.

# Doctors.SpecialityMaxLength
source: Speciality must not exceed 50 characters.
tr_tr: Uzmanlık alanı 50 karakteri geçmemelidir.

# Doctors.SummaryInfoRequired
source: Summary information is required.
tr_tr: Özet bilgisi gereklidir.

# Doctors.SummaryInfoMaxLength
source: Summary information must not exceed 500 characters.
tr_tr: Özet bilgisi 500 karakteri geçmemelidir.

# Doctors.BiographyRequired
source: Biography is required.
tr_tr: Biyografi gereklidir.

# Doctors.BiographyMaxLength
source: Biography must not exceed 2000 characters.
tr_tr: Biyografi 2000 karakteri geçmemelidir.

# Doctors.EmailRequired
source: Email is required.
tr_tr: E-posta gereklidir.

# Doctors.InvalidEmail
source: Invalid email format.
tr_tr: Geçersiz e-posta formatı.

# Doctors.PhoneNumberRequired
source: Phone number is required.
tr_tr: Telefon numarası gereklidir.

# Doctors.InvalidPhoneNumber
source: Invalid phone number format.
tr_tr: Geçersiz telefon numarası formatı.

# Doctors.ImageUrlRequired
source: Image URL is required.
tr_tr: Resim URL'si gereklidir.

# Doctors.InvalidImageUrl
source: Invalid image URL format.
tr_tr: Geçersiz resim URL'si formatı.

# Doctors.NotFound
source: Doctor not found.
tr_tr: Doktor bulunamadı.

# Doctors.Created
source: Doctor created successfully.
tr_tr: Doktor başarıyla oluşturuldu.

# Doctors.Updated
source: Doctor updated successfully.
tr_tr: Doktor başarıyla güncellendi.

# Doctors.Deleted
source: Doctor deleted successfully.
tr_tr: Doktor başarıyla silindi.

# Doctors.Reactivated
source: Doctor reactivated successfully.
tr_tr: Doktor başarıyla yeniden aktifleştirildi.

# Doctors.InvalidId
source: Doctor ID must be greater than zero.
tr_tr: Doktor ID sıfırdan büyük olmalıdır.

# Reviews.DoctorIdRequired
source: Doctor ID is required.
tr_tr: Doktor ID gereklidir.

# Reviews.NameRequired
source: Name is required.
tr_tr: İsim gereklidir.

# Reviews.MessageRequired
source: Message is required.
tr_tr: Mesaj gereklidir.

# Reviews.InvalidRating
source: Rating must be between 1 and 5.
tr_tr: Puan 1 ile 5 arasında olmalıdır.

# Reviews.Created
source: Review created successfully.
tr_tr: Yorum başarıyla oluşturuldu.

# Reviews.Updated
source: Review updated successfully.
tr_tr: Yorum başarıyla güncellendi.

# Reviews.Deleted
source: Review deleted successfully.
tr_tr: Yorum başarıyla silindi.

# Reviews.CreationFailed
source: Failed to create review.
tr_tr: Yorum oluşturma başarısız oldu.

# TreatmentFaqs.QuestionRequired
source: Question is required.
tr_tr: Soru gereklidir.

# TreatmentFaqs.AnswerRequired
source: Answer is required.
tr_tr: Cevap gereklidir.

# TreatmentFaqs.TreatmentIdRequired
source: Treatment ID is required.
tr_tr: Tedavi ID gereklidir.

# TreatmentFaqs.InvalidTreatmentId
source: Treatment ID must be greater than 0.
tr_tr: Tedavi ID sıfırdan büyük olmalıdır.

# TreatmentFaqs.Created
source: Treatment FAQ created successfully.
tr_tr: Tedavi SSS başarıyla oluşturuldu.

# TreatmentFaqs.CreationFailed
source: Failed to create treatment FAQ.
tr_tr: Tedavi SSS oluşturma başarısız oldu.

# TreatmentFaqs.NotFound
source: Treatment FAQ not found.
tr_tr: Tedavi SSS bulunamadı.

# TreatmentFaqs.Deleted
source: Treatment FAQ deleted successfully.
tr_tr: Tedavi SSS başarıyla silindi.

# TreatmentFaqs.Updated
source: Treatment FAQ updated successfully.
tr_tr: Tedavi SSS başarıyla güncellendi.

# Common.NotFound
source: The requested resource was not found
tr_tr: İstenen kaynak bulunamadı

# Exceptions.InvalidArgument
source: Invalid argument provided
tr_tr: Geçersiz argüman sağlandı

# Common.IdMismatch
source: Id in the URL does not match the Id in the body.
tr_tr: URL'deki Id, gövdedeki Id ile eşleşmiyor.

# Appointments.DoctorUnavailable
source: The doctor is currently unavailable.
tr_tr: Doktor seçilen saatte müsait değil.

# Appointments.PatientAlreadyHasAppointment
source: The patient already has a scheduled appointment.
tr_tr: Hasta, seçilen saatte zaten bir randevuya sahip.

# Doctors.EmailAlreadyExists
source: This email address is already associated with another doctor.
tr_tr: Bu e-posta adresine sahip bir doktor zaten mevcut.
